{
  "products": [
    {
      "id": 1,
      "name": "iPhone 13 Pro",
      "price": 10000,
      "image": "iphone13pro.jpg",
      "type": "Electronics",
      "description": "The latest iPhone model from Apple with advanced camera technology and 5G capabilities."
    },
    {
      "id": 2,
      "name": "Liquid Lipstick",
      "price": 150,
      "image": "lipstick.jpg",
      "type": "Cosmetics",
      "description": "A long-lasting liquid lipstick with a matte finish that stays put for up to 16 hours."
    },
    {
      "id": 3,
      "name": "Headphone",
      "price": 2000,
      "image": "headphone.jpg",
      "type": "Electronics",
      "description": "Buoyant Black boAt Rockerz 370 is a wireless headset that has been ergonomically designed to meet the needs of music lovers"
    },
    {
      "id": 4,
      "name": "To Kill a Mockingbird",
      "price": 2500,
      "image": "mockingbird.jpg",
      "type": "Books",
      "description": "A classic novel by Harper Lee that explores themes of race, injustice, and morality in the American South."
    },
    {
      "id": 5,
      "name": "Apple MacBook Pro",
      "price": 125000,
      "image": "macbook-pro.jpg",
      "type": "Electronics",
      "description": "The MacBook Pro is a powerful laptop designed for professionals. It features a stunning Retina display, the latest Intel processors, and up to 10 hours of battery life. It's perfect for creatives, developers, and anyone who needs a powerful and portable computer."
    },
    {
      "id": 6,
      "name": "Moisturizing Lotion+",
      "price": 500,
      "image": "moisturizer.jpg",
      "type": "Cosmetics",
      "description": "Clinique's Dramatically Different Moisturizing Lotion+ is a lightweight, oil-free moisturizer that provides all-day hydration. It's perfect for dry and combination skin types and helps strengthen the skin's moisture barrier to keep it looking healthy and radiant."
    },
    {
      "id": 7,
      "name": "Organic Brown Rice",
      "price": 400,
      "image": "brown-rice.jpg",
      "type": "Groceries",
      "description": "This organic brown rice is a healthy and delicious alternative to white rice. It's high in fiber, protein, and nutrients, and is perfect for rice bowls, stir-fries, and other Asian-inspired dishes."
    },
    {
      "id": 8,
      "name": "The Great Gatsby",
      "price": 999,
      "image": "great-gatsby.jpg",
      "type": "Books",
      "description": "F. Scott Fitzgerald's classic novel tells the story of Jay Gatsby, a mysterious millionaire who throws extravagant parties in the hopes of winning back his lost love. Set in the Roaring Twenties, it's a story of love, ambition, and the corrupting influence of wealth."
    }
  ],
  "details": [
    {
      "id": 1,
      "name": "iPhone 13 Pro",
      "description": [
        "     15 cm (6.1-inch) Super Retina XDR display Cinematic mode adds shallow depth of field and shifts focus automatically in your videos Advanced dual-camera system with 12MP Wide and Ultra Wide cameras; Photographic Styles, Smart HDR 4, Night mode, 4K Dolby Vision HDR recording 12MP TrueDepth front camera with Night mode, 4K Dolby Vision HDR recording A15 Bionic chip for lightning-fast performance"
      ],
      "image": "iphone13pro.jpg"
    },
    {
      "id": 2,
      "name": "Liquid Lipstick",
      "description": [
        "     Lipstick is a cosmetic product used to apply coloration and texture to lips, often made of wax and oil.",
        "Different pigments are used to produce color",
        "minerals such as silica may be used to provide texture."
      ],
      "image": "lipstick.jpg"
    },
    {
      "id": 3,
      "name": "Headphone",
      "description": [
        "     Rockerz 370 come equipped with latest Bluetooth v5.0 for instant wireless connectivity",
        "The powerful 300mAh battery provides up to 8 Hours of audio bliss",
        "40mm Dynamic Drivers supply immersive High Definition sound",
        "The headset has padded earcups for a comfortable experience",
        "The headphone has been ergonomically and aesthetically designed for a seamless experience",
        "One can connect to Rockerz 370 via dual modes for connectivity in the form of Bluetooth and AUX"
      ],
      "image": "headphone.jpg"
    },
    {
      "id": 4,
      "name": "To Kill a Mockingbird",
      "description": [
        "     To Kill a Mockingbird is both a young girl's coming-of-age story and a darker drama ",
        "about the roots and consequences of racism and prejudice, probing how good and evil can ",
        "coexist within a single community or individual."
      ],
      "image": "mockingbird.jpg"
    },
    {
      "id": 5,
      "name": "Apple MacBook Pro",
      "description": [
        "     Apple MacBook Pro is a macOS laptop with a 13.30-inch display that has a resolution of 2560x1600 pixels.",
        "12MP TrueDepth front camera with Night mode, 4K Dolby Vision HDR recording",
        "It is powered by a Core i5 processor and it comes with 12GB of RAM. ",
        "The Apple MacBook Pro packs 512GB of SSD storage."
      ],
      "image": "macbook-pro.jpg"
    },
    {
      "id": 6,
      "name": "Moisturizing Lotion+",
      "description": [
        "     This medication is used as a moisturizer to treat or prevent dry, rough, scaly, itchy skin and minor skin irritations",
        "(such as diaper rash, skin burns from radiation therapy).",
        "12MP TrueDepth front camera with Night mode, 4K Dolby Vision HDR recording",
        "Emollients are substances that soften and moisturize the skin and decrease itching and flaking."
      ]
    },
    {
      "id": 7,
      "name": "Organic Brown Rice",
      "description": [
        "     This rice has a sweet nutty taste and chewy texture.",
        "It is unpolished rice which has high fiber making it more nutritious",
        "lower glycemic index (GI). Brown rice also contains essential vitamins",
        "minerals including magnesium, manganese, potassium, phosphorous, iron, and B-vitamins."
      ],
      "image": "moisturizer.jpg"
    },
    {
      "id": 8,
      "name": "The Great Gatsby",
      "description": [
        "     The Great Gatsby, Third novel by American author F. Scott Fitzgerald, published in 1925.",
        "Set in Jazz Age New York, it tells the tragic story of Jay Gatsby, a self-made millionaire.",
        "pursuit of Daisy Buchanan, a wealthy young woman whom he loved in his youth."
      ],
      "image": "great-gatsby.jpg"
    }
  ],
  "reviews": [
    {
      "id": 3569,
      "name": "surya",
      "email": "surya@gmail.com",
      "message": "book font is not visible ",
      "product": "The Great Gatsby"
    },
    {
      "id": 5640,
      "name": "surya",
      "email": "surya@gmail.com",
      "message": "The screen is AMAZING.. it doesn't have 90 or 120 hz refresh rate but it FEELS better than my Nord with 90 hz!!",
      "product": "iPhone 13 Pro"
    },
    {
      "id": 2970,
      "name": "mohan",
      "email": "mohan270601@gmail.com",
      "message": "Product is good, but boat needs to workout in comfort thing, compared to Sony what I have is more comfortable compared to this. .. this feels pressing to ears - not comfortable (3 out of 5). ..",
      "product": "Headphone"
    },
    {
      "id": 6521,
      "name": "mohan surya",
      "email": "mohan@gmail.com",
      "message": "The 2022 MacBook Air has a better chip, bigger display and new design, but is it worth spending more while the M1 version is still on sale?",
      "product": "Apple MacBook Pro"
    },
    {
      "id": 7536,
      "name": "mohan",
      "email": "surya@gmail.com",
      "message": "Quickly and efficiently size and reset window dimensions",
      "product": "Apple MacBook Pro"
    },
    {
      "id": 3055,
      "name": "raja",
      "email": "raja@gmail.com",
      "message": "Volume for GPS cannot be increased. I have wasted over an hour searching for a solution.",
      "product": "iPhone 13 Pro"
    }
  ]
}